[
  {
    "Id": "1495712",
    "ThreadId": "662654",
    "Html": "Hi  I imported the SEAL project in visual studio 2015 and tried to build it. Build was successful, but when I try to run the main.cpp in SEALExamples using the ''fn + f5&quot; , I get an error saying &quot;The application that you are trying to run is not a valid win32 application&quot;. Any idea what that is ?<br />\n",
    "PostedDate": "2017-04-21T23:07:42.703-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1495917",
    "ThreadId": "662654",
    "Html": "Your startup project is not set correctly to SEALExamples (it's probably the library project instead). Simply look up SEALExamples in the solution explorer, click it with mouse2 and select &quot;Set as start-up project&quot;. Then it should work.<br />\n",
    "PostedDate": "2017-04-28T18:14:19.047-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1496601",
    "ThreadId": "662654",
    "Html": "Thanks, that worked.\r<br />\nAlso, I am trying to make a sample application that would store the generated keys and encrypted data (BigPolyArray objects) on stable storage and then can be sent over the network to some server for decryption.Is it possible to serialize the generated keys and the encrypted integers (BigPolyArray objects)? <br />\n",
    "PostedDate": "2017-05-19T06:47:40.227-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1497031",
    "ThreadId": "662654",
    "Html": "My bad. There are save and load functions available in the BigPoly and BigPolyArray classes. I have another query now. Encryption of a single integer when stored in a binary format takes about 33 KB of space and I encrypted each pixel of a 350 x 263 grayscale image. The size of the folder containing these encryptions of each pixel was 2.8 GB !!!!! The size of the image was only about 61 KB. Getting 2.8 GB for 61 KB image. how can I reduce the size of cipher texts?<br />\n",
    "PostedDate": "2017-06-12T12:11:27.537-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]